#include <stdio.h>
#include <cs50.h>
#include <math.h>

int main(void) {
	
	int con, a, b, c, d, e, g;
	float cash;
	
	do { 																						// Цикл перевірки введених данних;
	cash = get_float("Enter dollars: ");
	} while (cash < 0);

	int cash2 = round(cash * 100);																// Перевід з дробного в ціле число;
	
	if (cash2 >= 25) {																			// Цикл починається якщо сума більше 25 ;		
		con = cash2 / 25;																		// к-сть монеток номіналом 25;
		a = cash2 - (con * 25);																	// вираховує залишок монет(який не можна заповнити монетою 25);
					
			if (a >= 10)  {																		// Цикл починається якщо залишок монет більший або рівний 10;
				b = a / 10;	 																	// к-сть монеток номіналом 10;
				c = a - (b * 10);																// вираховує залишок монет;		
						
					if (c >= 5) {																// Цикл починається якщо залишок монет більший або рівний 5;
						d = 1;																	// к-сть монет номіналом 5;
						e = c - 5;	}															// к-сть монет номіналом 1;
					else if (c < 5) 	{ 														// Цикл починається якщо залишок монет менше 5;
						e = c / 1; d = 0;	}} 													// к-сть монет номіналом 1;
										
			else if (a < 5) { b = a / 1; d = 0; e = 0; }										// Цикл починається якщо залишок монет менший 5, визначає к-сть монет номіналом 1;
			else if (a < 10 || a >= 5) { b = 1; d = a - 5; e = 0;} }							// Цикл починається якщо залишок монет більший 5 і менший 10 (вираховує к-сть монет;
																								// номіналом 5 і 1);
																								
	else if (cash2 < 25 || cash2 >= 10) 	{													// Цикл починається якщо сума менше 25 але більше 10;
		con = cash2 / 10; 																		// к-сть монет номіналом 10;						
		g = cash2 - (con * 10);																	// вираховує залишок монет(який не можна заповнити монетою 10);
			
			if (g < 5) {d = g / 1; b = 0; e = 0; }												// Цикл починається якщо залишок менше 5, і вираховує к-сть монет номіналом 1;									
			else if (g >= 5) { b = 1; d = g - 5; e = 0;	}										// Цикл починається якщо залишок більший або рівний 5 (вираховує к-сть монет	
			}																					// номіналом 5 і 1);
							
	else if (cash2 < 5) 					{	con = cash2 / 1; b = 0; d = 0; e = 0;	}		// Цикл починається якщо сума менще 5 (вираховує к-сть монет номіналом 1);																							
	else if (cash2 < 10 || cash2 >= 5) 		{	con = 1; b = cash2 - 5; d = 0; e = 0;	}		// Цикл починається якщо сума менше 10 і більша або рівна 5 (вираховує к-сть монет
																								// номіналом 1 і 5);
	int cashf = con + b + d + e;																// Вираховує загальну к-сть монет;
	
	printf("%i", cashf);																		// Вивід к-сті монет;
	printf("\n");																				// Пустий рядок як умова задачі;
	
	return 0;
}
